-- phpMyAdmin SQL Dump
-- version 5.1.1deb5ubuntu1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Мар 04 2023 г., 01:07
-- Версия сервера: 8.0.32-0ubuntu0.22.04.2
-- Версия PHP: 8.1.2-1ubuntu2.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `Internet-Shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `books`
--

CREATE TABLE `books` (
  `id` int NOT NULL,
  `title` varchar(1000) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `author` varchar(1000) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_general_ci,
  `image` varchar(1000) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `book_id` varchar(1000) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `publication_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `price` int NOT NULL DEFAULT '0',
  `count` int NOT NULL DEFAULT '0',
  `year` int NOT NULL,
  `language` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL,
  `country` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL,
  `sold_count` int NOT NULL DEFAULT '0',
  `isforeveryone` varchar(10) COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'yes'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `books`
--

INSERT INTO `books` (`id`, `title`, `author`, `description`, `image`, `book_id`, `publication_date`, `price`, `count`, `year`, `language`, `country`, `sold_count`, `isforeveryone`) VALUES
(1, 'Інтернат', 'Сергій Жадан', 'Події роману відбуваються на Донбасі протягом трьох зимових днів 2015 року. Тридцятип\'ятирічний вчитель української мови на ім\'я Паша вирушає до міста (прототипом вірогідно є Дебальцеве), щоб забрати звідти свого племінника, який живе в інтернаті. Час для здійснення такої мандрівки, однак, не зовсім підхожий, адже українська армія саме покидає місто, яке оточують російські окупаційні війська.\r\nСлово «інтернат» використовується як метафора, під якою мається на увазі неукоріненість, невпорядкованість та загубленість нашого суспільства, що так і не призвичаїлося у цій країні та страждає на так званий синдром інтернату. Автор зображує це почуття неукоріненості на прикладі такого специфічного регіону як Донбас, та вказує на те, що подолання цього почуття — один із найважливіших факторів подолання конфлікту', 'internat.jpeg', '5', '2023-02-27 06:22:28', 300, 20, 2017, '1', '1', 43, 'yes'),
(2, 'Сторонній', 'Альбер Камю', '«Сторо́нній» (фр. L\'Étranger; інший варіант перекладу: «Чужий») — дебютний роман французького письменника Альбера Камю. Твір написаний у 1942 році. Є своєрідним творчим маніфестом, що втілив в собі суть пошуку абсолютної свободи — свободи від вузьких моральних норм тогочасної буржуазної культури. Повість написана у своєрідному стилі — короткими фразами в минулому часі. Вона надзвичайно сильно вплинула на більшість французьких і європейських авторів другої половини XX століття.\r\n\r\nУ творі йдеться про історію якогось Мерсо — француза, що мешкає в Алжирі і скоїв убивство, проте не розкаявся, відмовився захищатися в суді, і зрештою суд призначив йому смертну кару. Відомою є перша фраза книги — «Моя мати померла сьогодні. А може і вчора, не знаю точно».', 'the-stranger.jpeg', '9', '2023-02-27 06:35:38', 650, 8, 1942, '1', '4', 4, 'yes'),
(3, 'У пошуках утраченого часу', 'Марсель Пруст', 'Головні ідеї та мотиви твору вже присутні в романі «Жан Сантей» (1896–1899) та в незакінченій збірці есеїв «Проти Сент-Бева» (1908–1909). Систематично працювати над романом Пруст почав з 1909 року[1]. 1911 року частина рукопису вже була передрукована, його початкова назва: «Мінливість серця. Втрачений час. Перша частина» (фр. Les Intermittence du coeur. Le Temps perdu. Première partie). 1912 року Пруст безуспішно пропонував рукопис у видавництві «Фаскель». Потім видавництво «Нувель Ревю Франсез» в особі Андре Жіда також забракувало рукопис. Ще одна відмова спідкала Пруста у видавництві Оллендорфф, аж поки видавництво Ґрассе не погодилося на публікацію роману. Водночас Пруст оголосив назву другої й останньої частини роману: «Віднайдений час» (фр. Le Temps retrouvé).', 'in-search-of-lost-time.jpeg', '10', '2023-02-27 06:35:38', 500, 0, 1927, '1', '4', 2, 'yes'),
(4, 'Процес', 'Франц Кафка', '«Проце́с» (нім. Der Prozeß) — роман Франца Кафки, опублікований після його смерті в 1925 році. «Процес» є центральним твором літературної спадщини Кафки. Твір особливий ще й тим, що послугував сюжетом для постмодерного театру та кінематографа. Глави рукопису не було пронумеровано, вони зберігалися в окремих конвертах. Та послідовність, в якій їх публікують, належить Максу Броду (він відсортував глави, опираючись на спогади про розмови з автором)[1].\r\n\r\nТвір оповідає про чоловіка Йозефа К., якого переслідує невідома сила правосуддя. Йозеф намагається з\'ясувати в чому його звинувачують і хто саме, поступово усвідомлюючи абсурдність цього таємничого правосуддя і марність спроб йому протистояти.', 'the-trial.jpeg', '9', '2023-02-27 06:43:09', 350, 11, 1925, '1', '12', 0, 'no'),
(5, 'Маленький принц', 'Антуан де Сент-Екзюпері', 'Пілот здійснює вимушену посадку в пустелі Сахара і зустрічає одного незвичайного та загадкового хлопчика — принца з іншої планети — астероїда B-612. Маленький принц розповідає про свої пригоди на Землі, говорить про дивовижну троянду, яку залишив на своїй малій планеті, про своє життя на астероїді, де є три вулкани. Він проводить час, приводячи до ладу свій астероїд, виполюючи баобаби, які намагаються глибоко прорости і заполонити всю планету. Маленький принц любить спостерігати заходи сонця, які на його малій планеті можна побачити скільки завгодно разів на день. Одного дня Маленький принц відлітає, щоб вивчити і пізнати інші місця Всесвіту. Відвідавши кілька інших астероїдів, він зустрічає багато дивних дорослих: короля, якому здається, що він править зірками; честолюбця, який хоче, щоб усі ним захоплювалися; п\'яницю, який п\'є, щоб забути, що йому соромно пити; ділову людину, яка постійно рахує зірки, бо думає, що володіє багатьма з них і хоче купити ще більше; ліхтарника, який, вірний своєму слову, кожну хвилину запалює і гасить ліхтар; географа, який записує в книгу розповіді мандрівників, але сам ніколи нікуди не подорожує. За порадою географа Маленький принц відвідує Землю, де, крім пілота, який зазнав аварії літака, зустрічає теж інших персонажів і, спілкуючись з ними, дізнається багато важливих речей.', 'the-little-prince.jpeg', '11', '2023-02-27 06:43:09', 700, 0, 1943, '1', '4', 44, 'yes'),
(6, 'Людина в пошуках справжнього сенсу. Психолог у концтаборі', 'Віктор Франкл', 'Три роки ув’язнення в концентраційних таборах Дахау і Освенцимі, голод, приниження, нелюдська жорстокість та страждання — не кожен зміг вижити в таких умовах, а написати про свій досвід життєстверджуючий твір наважився лише Віктор Франкл, австрійський психолог і філософ, засновник логотерапії.\n\n«Людина у пошуках справжнього сенсу. Психолог у концтаборі» розійшлась накладом в 10 мільйонів екземплярів і переведена на 24 мови світу. Книга складається з двох частин: власне ув’язнення, опис життя в концтаборі та роз’яснення, спостереження та виведення нового психіатричного методу — логотерапії і введення поняття проактивності.', 'man\'s-search-for-meaning.jpeg', '13', '2023-02-27 06:55:14', 342, 3, 1946, '5', '11', 5, 'yes'),
(7, 'Подорож на край ночі', 'Луї-Фердінан Селін', 'Подорож на край ночі — це оповідь від першої особи, в якій головний герой Бардамю розповідає про свій досвід Першої світової війни, про колоніалізм в Африці, про життя у США в міжвоєнний період, а також про соціальне становище загалом.\r\n\r\nБардамю бачив Велику війну та злочинну безпомічність своїх командирів в окопах. Саме там він втратив віру в людей. Велика війна є водночас відправною точкою його «подорожі» без повернення. Фактично, весь роман є викриттям жахів війни, сповненим глибокого песимізму щодо соціальних стосунків та людства. Потім Бардамю описує своє перебування в Африці, де знову ж таки жахається ницості та цинічності колоніального режиму. З Африки Бардамю тікає до фордистської Америки. Америка стала для нього єдиним місцем, де він зустрів людину (Молі), яку любив до кінця своєї життєвої подорожі. Проте і робота на фабриках Детройта виявилася для гловного героя щоденним зіткненням з людськими стражданнями. Після США Бардамю повертається до Франції, щоб закінчити своє навчання на медичному факультеті й стати лікарем бідних. Після навчання Бардамю відкриває лікарську практику в одному з передмість Парижа. Він знову стикається з різноманітними проявами людської біди, горя й страждання, що загалом перегукується з його досвідом Першої світової війни та життя в колоніальній Африці. Врешті сам автор роману робить висновок, що «життя — це агонія, якій немає кінця».', 'journey-to-the-end-of-the-night.jpeg', '12', '2023-02-27 06:55:14', 400, 1, 1933, '3', '4', 3, 'yes'),
(8, 'Архіпелаг ГУЛАГ', 'Олександр Солженіцин', 'Тритомна книга складається здебільшого з наративу, зібраного зі свідчень очевидців й дослідницького матеріалу, а також із власного досвіду автора, котрий був в\'язнем виправно-трудових таборів. Книга простежує історію системи виправно-трудових таборів, які існували в Радянському Союзі з 1918 по 1956 рік.\r\n\r\nКнига написана, як зазначено при її кінці, у 1958—1968 роках. Вперше опублікована в оригіналі російською мовою у Франції у 1973 році. У Радянському Союзі існувала у форматі самвидаву, аж до офіційного видання у 1989 році. Інформацію для написання книги Солженіцина надали 227 осіб. У виданні 2007 року був розкритий список «свідків архіпелагу, чиї розповіді, листи, мемуари поправки використані при створенні цієї книги». Список складався з 257 осіб. Частину тексту написали знайомі Солженіцина, зокрема Р. П. Тенно.', 'the-gulag-archipelago.jpeg', '14', '2023-02-27 07:36:26', 432, 12, 1973, '10', '13', 7, 'no'),
(9, 'Щоденник Анни Франк', 'Анна Франк', 'Щоденник Анни Франк (нід. Het achterhuis, дослівно «У задній частині будинку», інші переклади українською — «Щоденник», «Сховище. Щоденник у листах») — записи нідерландською мовою, які робила єврейська дівчинка Анна Франк з 12 червня 1942 по 1 серпня 1944 року в період нацистської окупації Нідерландів[2]. З початку 1944 року Франк почала готувати записи до можливої публікації після звільнення Нідерландів (змінила імена дійових осіб), проте ця робота залишилася незавершеною.\r\n\r\nОстанній запис у щоденнику датований 1 серпня 1944 року, через три дні гестапо заарештувало всіх, хто ховались у притулку. Анна Франк померла в концтаборі Берґен-Бельзен. Записи щоденника збереглися, і їх передали батькові дівчинки — Отто Франку, який вижив в Освенцимі. 1947 року уклав скорочений варіянт для публікації. Отто Франк заповів оригінал щоденника Нідерландському державному інституту військової документації.', 'the-diary-of-a-young-girl.jpeg', '12', '2023-02-27 07:36:26', 567, 12, 1947, '12', '14', 23, 'yes'),
(10, 'Війна світів', 'Герберт Веллс', '«Війна світів» (англ. The War of the Worlds) — фантастичний роман англійського письменника Герберта Велза. Написаний у 1897 році, був виданий в квітні того ж року в журналі «Pearson\'s magazine» і в лютому 1898 року окремою книгою.\r\n\r\nРоман описує вторгнення інопланетних прибульців (марсіан, марсіян в перекладі 1977 року) на Землю та марні спроби протистояти їм, що отримує, однак, несподіваний розв\'язок. Сюжет роману був підказаний братом письменника — йому й присвячена «Війна світів».', 'the-war-of-the-worlds.jpeg', '3', '2023-02-27 12:33:33', 672, 12, 1898, '2', '2', 23, 'yes'),
(11, 'Володар перснів', 'Дж.Р.Р.Толкін', '«Володар перснів» (також «Володар перстенів»[1]; англ. «The Lord of the Rings»)  — епічний роман у жанрі «фентезі» англійського письменника, філолога та професора Оксфордського університету Дж. Толкіна. Оповідь почалася як продовження до попередньої роботи Толкіна, «Гобіт», але згодом розвинулась у набагато більшу історію. Її було написано поетапно між 1937 та 1949 роками, істотну частину — під час Другої світової війни.[2] Роман є другим у світі бестселером, кількість проданих примірників якого перевищила 150 млн.[3] Книга також входить у Рейтинг 100 найкращих книг усіх часів журналу Ньюсвік під номером 35[4] а у голосуванні The Big Read проведеного BBC 2003 року у Великій Британії роман посів перше місце.', 'the-lord-of-the-rings.jpeg', '8', '2023-02-27 12:33:33', 731, 5, 1955, '2', '2', 56, 'yes'),
(12, 'Мартін Іден', 'Джек Лондон', '«Мартін Іден» (англ. Martin Eden) — роман американського письменника Джека Лондона 1909 року про молодого моряка, який намагається стати письменником для того, щоб змінити свою класову приналежність і заслужити любов дівчини. Досягнувши світового визнання він розчаровується у коханні, грошах та оточенні.', 'martin-eden.jpeg', '9', '2023-02-27 13:49:49', 234, 0, 1909, '2', '3', 8, 'yes'),
(13, 'Собака Баскервілів', 'Артур Конан Дойл', '«Собака Баскервілів» (англ. «The Hound of the Baskervilles») — детективний роман шотландського письменника Артура Конана Дойла. Один із найвідоміших творів, де головними героями є приватний детектив Шерлок Холмс та його друг доктор Вотсон.', 'the-hound-of-the-baskervilles.jpeg', '1', '2023-02-27 13:49:49', 343, 14, 1902, '2', '2', 45, 'yes'),
(14, 'Граф Монте-Крісто', 'Олександр Дюма', '«Граф Монте-Крісто» (фр. Le Comte de Monte-Cristo) — пригодницький роман французького письменника Александра Дюма (батька), виданий 1844 року. Основним мотивом роману є помста, а основною ідеєю є те, що вона не приносить ні задоволення, ні щастя.\r\n\r\nРоман розповідає історію юнака Едмона Дантеса, несправедливо звинуваченого й запротореного у в\'язницю в замку Іф, де він провів 14 років. Дантесу щастить неймовірним чином утекти й відшукати скарб, про який йому розповів інший в\'язень. Маючи кошти, Дантес відшукує своїх кривдників, які на той час уже зробили кар\'єру й займають високе становище в суспільстві, й руйнує їхнє життя, але врешті-решт, після вчиненої помсти, залишається з пусткою в душі.', 'the-count-of-monte-cristo.jpeg', '9', '2023-02-27 13:55:13', 430, 4, 1844, '3', '4', 7, 'yes'),
(15, 'Три мушкетери', 'Олександр Дюма', '«Три мушкете́ри» — роман французького письменника Александра Дюма, написаний у 1844. Книга присвячена пригодам юного французького дворянина д\'Артаньяна, який покинув свою батьківщину Гасконь, щоб стати мушкетером короля Франції. Інші герої роману та друзі мушкетера: Атос, Портос і Араміс. Історія д\'Артаньяна продовжується в двох інших романах трилогії: «Двадцять років потому» і «Віконт де Бражелон, або Десять років потому».\r\n\r\nІсторія, переказана Дюма, присвячена пригодам д\'Артаньяна і його друзів в період між 1625 і 1628 роками. У ці роки вони були включені в пригоди та інтриги між королем Людовіком XIII, його першим міністром кардиналом Рішельє, королевою Анною Австрійською і її англійським коханцем лордом Бекінгемом.', 'the-three-musketeers.jpeg', '9', '2023-02-27 13:55:13', 457, 6, 1844, '3', '4', 16, 'yes'),
(16, 'Прекрасний новий світ', 'Олдос Гакслі', '«Прекра́сний нови́й світ»[1][2][3], або «Яки́й чуде́сний світ нови́й!»; (англ. Brave new world) — роман-антиутопія (утопія) англійського письменника Олдоса Гакслі (англ. Aldous Huxley).\r\n\r\nРоман побачив світ 1932 року. Дія твору відбувається у вигаданому суспільстві 632 року «Фордівської Ери». Автор, онук видатного біолога Томаса Генрі Гакслі, побудував світ свого роману, вклавши в нього своє ставлення до сучасного йому американського суспільства, заснованого на принципах доцільності і надмірного споживання.\r\n\r\nНомер 23 у Рейтингу 100 найкращих книг усіх часів журналу Ньюсвік[4]. У рейтингу 100 найкращих романів серії «Сучасна бібліотека» (Modern Library), яка видається з 1917 року видавництвом «Random House LLC.», займає 5-е місце.', 'brave-new-world.jpeg', '3', '2023-02-27 14:01:41', 378, 2, 1932, '2', '2', 9, 'yes'),
(17, 'Колгосп тварин', 'Джордж Орвелл', '«Колгосп тварин» (англ. Animal Farm; в інших українських перекладах також: «Ферма „Рай для тварин“», «Скотоферма», «Скотохутір», «Хутір тварин») — повість-антиутопія англійського письменника Джорджа Орвелла, написана у 1943—1944 роках, вперше видана 17 серпня 1945 р.\r\n\r\nНомер 61 у «Рейтингу 100 найкращих книжок усіх часів» журналу Ньюсвік[1]. «Колгосп тварин» у списках книжок:[', 'animal-farm.jpeg', '15', '2023-02-27 14:01:41', 487, 15, 1945, '2', '2', 49, 'yes'),
(18, 'Різдвяна пісня в прозі, або Різдвяне оповідання з привидами', 'Чарлз Дікенс', '«Різдвя́на пі́сня в про́зі, або́ Різдвя́не оповіда́ння з при́видами» (англ. A Christmas Carol) — різдвяна повість англійського письменника Чарльза Дікенса. Входить до збірки «Різдвяні повісті». Перше видання вийшло 19 грудня 1843 року з ілюстраціями Джона Ліча[2]. У творі розповідається про старого скнару Ебенезера Скруджа, до якого навідується привид його колишнього компаньйона Джейкоба Марлі, а також духи Минулого, Теперішнього і Майбутнього Різдва, які змушують його переглянути своє ставлення до життя та навертають його до щирості та добросердя.\r\n\r\n«Різдвяна пісня» стала несподіваним успіхом для Дікенса. Перший наклад налічував шість тисяч екземплярів, які розійшлись впродовж трьох днів[3]. Письменник написав книгу насамперед з метою покращення свого фінансового стану.', 'a-christmas-carol.jpeg', '16', '2023-02-27 14:08:40', 444, 20, 1843, '2', '2', 101, 'yes'),
(19, 'Острів скарбів', 'Роберт Луїс Стівенсон', '«О́стрів скарбі́в» (англ. «Treasure Island») — пригодницький роман шотландського письменника Роберта Луїса Стівенсона. Твір вперше надруковано в 1881 і 1882 роках на сторінках дитячого журналу «Young Folks». Спочатку роман називався «Корабельний кухар». Окремою книгою вийшов 1883 року вже під назвою «Острів скарбів».', 'treasure-island.jpeg', '9', '2023-02-27 14:08:40', 503, 14, 1883, '2', '2', 18, 'yes'),
(20, 'Алхімік', 'Пауло Коельйо', '«Алхі́мік» (порт. O Alquimista) — роман бразильського письменника Пауло Коельйо, вперше опублікований у 1988 році. Написаний португальською мовою та перекладений сімдесятьма однією мовою станом на 2011 рік.[джерело?]\r\n\r\nРоман «Алхімік», в основу якого покладено алегорію, розповідає про подорож пастуха з Андалусії до Єгипту, після повторюваних снів, які показували, що саме там він знайде свій скарб.\r\n\r\nКнига набула статусу міжнародного бестселеру. За підрахунками Франс Прес, її продажі склали понад 65 мільйонів копій у понад 160 країнах світу, увійшовши до Книги рекордів Гіннеса за найбільшу кількість перекладів за життя автора.', 'the-alchemist.jpeg', '9', '2023-02-27 14:19:01', 215, 34, 1988, '11', '15', 1, 'no'),
(21, '1984', 'Джордж Орвелл', '«1984» (відомий також під назвою «Одна тисяча дев\'ятсот вісімдесят четвертий») — антиутопія англійського письменника Джорджа Орвелла, написана 1948 року (у назві роману цифри 4 і 8 переставлені місцями) й опублікована 1949-го.\r\n\r\nРоман розповідає історію Вінстона Сміта і його деградації під впливом[1] тоталітарної держави, у якій він живе. Є найвідомішою і найцитованішою антиутопією у літературі і стоїть в одному ряду з «Прекрасним новим світом» (англ. Brave new world) Олдоса Гакслі і «451° за Фаренгейтом» Рея Бредбері.', 'nineteen-eighty-four.jpeg', '15', '2023-02-27 14:19:01', 607, 12, 1948, '2', '2', 23, 'yes'),
(22, 'Гаррі Поттер і філософський камінь', 'Джоан Роулінг', '«Га́ррі По́ттер і філосо́фський ка́мінь» (англ. «Harry Potter and the Philosopher\'s Stone», заголовок американського видання «Гаррі Поттер і камінь чарівника»: «Harry Potter and the Sorcerer\'s Stone») — перший роман серії «Гаррі Поттер» британської письменниці Дж. К. Ролінґ. Опублікований 30 червня 1997 року видавництвом «Блумсбері Паблішинґ» у Лондоні. В 2001 році було випущено однойменний художній фільм на основі роману[1].\r\n\r\nСтаном на серпень 2007 року книга займала друге місце у списку бестселерів усіх часів серед творів художньої літератури нерелігійної та неполітичної тематики (поступаючись лише «Дону Кіхоту» Мігеля де Сервантеса)[джерело?].\r\n\r\nУкраїнською мовою роман було перекладено Віктором Морозовим і опубліковано видавництвом «А-БА-БА-ГА-ЛА-МА-ГА» 13 квітня 2002 року.', 'harry-potter-and-the-philosopher\'s-stone.jpeg', '8', '2023-02-27 14:22:21', 403, 29, 1997, '2', '2', 100, 'yes'),
(23, 'Гаррі Поттер і таємна кімната', 'Джоан Роулінг', '«Га́ррі По́ттер і тає́мна кімна́та» (англ. «Harry Potter and the Chamber of Secrets») — другий роман серії «Гаррі Поттер» британської письменниці Дж. К. Ролінґ. Опублікований 2 липня 1998 року видавництвом «Блумсбері Паблішинґ» у Лондоні. У 2002 році на основі роману знято однойменний художній фільм.', 'harry-potter-and-the-chamber-of-secrets.jpeg', '8', '2023-02-27 14:22:21', 487, 0, 1998, '2', '2', 92, 'yes'),
(24, 'Гаррі Поттер і в\'язень Азкабану', 'Джоан Роулінг', '«Гаррі Поттер і в\'язень Азкабану» (англ. «Harry Potter and the Prisoner of Azkaban») — третій роман серії «Гаррі Поттер» британської письменниці Дж. К. Ролінґ. Опублікований 8 липня 1999 року видавництвом «Блумсбері Паблішинґ» у Лондоні. У 1999 році отримав дві літературні премії: «Вайтбред (Коста)» і «Премію Брема Стокера», а також був номінований на кілька інших премій, внаслідок чого визнаний одним з найвидатніших творів у жанрі «фентезі» за останні роки. У 2004 році на основі роману знято однойменний художній фільм. Українською мовою роман перекладений Віктором Морозовим і опублікований видавництвом «А-БА-БА-ГА-ЛА-МА-ГА» 10 травня 2002 року.', 'harry-potter-and-the-prisoner-of-azkaban.jpeg', '8', '2023-02-27 14:26:34', 512, 4, 1999, '2', '2', 110, 'no'),
(25, 'Гобіт, або Туди і звідти', 'Джон Р. Р. Толкін', '«Го́біт, або Туди́ і зві́дти» (англ. The Hobbit, or There and Back Again, варіант перекладу — «Гобіт, або Мандрівка за Імлисті гори») — роман-казка англійського письменника Джона Роналда Руела Толкіна. Вперше опублікований 1937 року видавництвом «Джордж Аллен і Анвін», із часом став класикою дитячої літератури. В основі сюжету — подорож гобіта Більбо Торбина, чарівника Ґандальфа та тринадцятьох гномів на чолі з Торіном Дубощитом. Їхній шлях лежить до Самотньої Гори, де дракон Смоґ стереже захоплені ним гномівські скарби.\r\n\r\nПишучи «Гобіта», Толкін звертався до мотивів скандинавської міфології та давньоанглійської поеми «Беовульф». На думку низки дослідників, у романі відобразився досвід участі письменника в Першій світовій війні. Характерною особливістю твору є протиставлення архаїчного й сучасного стандартів поведінки, зокрема через стилістику мови персонажів. Головний герой, Більбо Торбин, має чимало характеристик сучасної людини і, як наслідок, на тлі стародавнього світу видається певним анахронізмом. Відповідно, у творі порушується питання співвідношення людини сучасної культури зі стародавніми героями, в оточенні яких вона перебуває. Протягом історії відбувається розвиток головного героя — участь у пригодах стає для Більбо шляхом самопізнання. У конфлікті за скарби, який виникає в пізній фазі сюжету роману, автор обігрує почуття жадоби до матеріальних цінностей та його подолання.\r\n\r\n«Гобіт, або Туди і звідти» — перший опублікований твір Толкіна, дія якого відбувається у світі Середзем\'я. Книга отримала схвальні відгуки критиків і мала попит у читачів, що спонукало видавця просити автора про продовження. 1937 року Толкін узявся за написання нової історії про гобітів. Підсумком роботи став роман «Володар Перснів» — на відміну від «Гобіта», цей твір орієнтований на дорослу читацьку аудиторію. Щоб досягти узгодженості між двома книгами, Толкін зробив деякі зміни в початковому тексті «Гобіта», насамперед щодо опису зустрічі Більбо з Ґолумом.', 'the-hobbit.jpeg', '8', '2023-02-27 14:26:34', 604, 16, 1937, '2', '2', 59, 'yes'),
(26, 'Гра престолів', 'Джордж Мартін', '«Гра престолів» (англ. A Game of Thrones) — перший роман з циклу «Пісня льоду й полум\'я» американського письменника Джорджа Мартіна. Жанр – епічне фентезі з елементами жаху. Вперше твір був опублікований 1996 року видавництвом Bantam Spectra. Дія роману відбувається у вигаданому всесвіті. У центрі твору три основні сюжетні лінії — події, що передували початку династичних війн за владу над континентом Вестерос, який нагадує Європу часів Високого Середньовіччя; насувається загроза навали племен здичавілих і демонічної раси Інших; а також подорож дочки поваленого короля в спробах повернути Залізний трон. Оповідання ведеться від третьої особи, поперемінно з точки зору різних персонажів.', 'a-game-of-thrones.jpeg', '8', '2023-02-27 14:31:24', 812, 12, 1996, '2', '3', 203, 'yes'),
(27, 'Битва королів', 'Джордж Мартін', '«Битва королів» (1998, англ. A Clash of Kings) — другий роман з циклу «Пісня льоду й полум\'я» американського письменника Джорджа Мартіна. Жанр — епічне фентезі з елементами жахів. Отримала в 1999 році премію «Локус» як найкращий фантастичний роман і номінована на премію «Неб\'юла»[1].', 'a-clash-of-kings.jpeg', '8', '2023-02-27 14:31:24', 900, 14, 1998, '2', '3', 29, 'yes'),
(28, 'Буря мечів', 'Джордж Мартін', '«Буря мечів» (2000, англ. A Storm of Swords) — третій роман з циклу «Пісня льоду й полум\'я» американського письменника Джорджа Мартіна. Жанр — епічне фентезі з елементами хоррора. Вперше вона була опублікована 8 серпня 2000 року в Сполученому Королівстві[1] з наступним виданням у США в листопаді 2000 року. Цим публікаціям передувала повість під назвою «Шлях Дракона», яка містила в одній книзі деякі глави з роману про Дейєнеріс Таргарієн.\r\n\r\nРоман отримав у 2001 році премію Локус як найкращий фантастичний роман, а в 2002 році — Премію «Геффен» і був номінований на премії Неб\'юла і Г\'юго[2].', 'a-storm-of-swords.jpeg', '8', '2023-02-27 14:35:13', 794, 15, 2000, '2', '3', 15, 'yes'),
(29, 'Бенкет круків', 'Джордж Мартін', '«Бенкет круків» (2005, англ. A Feast for Crows) — четвертий роман з циклу «Пісня льоду й полум\'я» американського письменника Джорджа Мартіна. Жанр — епічне фентезі з елементами хоррора. Вперше роман був опублікований 17 жовтня 2005 року в Сполученому Королівстві[1] з наступним виданням 8 листопада 2005 у США[2].\r\n\r\nСпочатку, Мартін планував, що «Бенкет круків» і «Танок з драконами» будуть складати першу і другу книги четвертого роману. Але внаслідок великої кількості персонажів, сюжетних ліній і обсягу рукопису, в травні 2005 року він оголосив, що вирішив розбити книгу на два окремих романи, в яких дія проходить одночасно з різними героями. Мартін також зазначив, що серія Пісні Льоду й Полум\'я тепер, ймовірно буде складатися із семи романів.[3]\r\n\r\n«Бенкет круків» увійшов до списку бестселерів «Нью-Йорк таймс».[4] У 2006 році роман був номінований на премії Локус, Г\'юго і Британську премію фентезі (BFS) : Найкращий фантастичний роман.[5]', 'a-feast-for-crows.jpeg', '8', '2023-02-27 14:35:13', 847, 29, 2005, '2', '3', 22, 'yes'),
(30, 'Танок драконів', 'Джордж Мартін', '«Тано́к з драко́нами» (2011, англ. A Dance with Dragons) — п\'ятий із семи запланованих романів в серії фентезі «Пісня льоду й полум\'я» американського письменника Джорджа Мартіна. Жанр — епічне фентезі з елементами горора. 3 березня 2011 року видавець Bantam Spectra оголосив, що роман буде випущено 12 липня 2011 року[1]. 27 квітня 2011 року Мартін передав своєму редактору більш ніж 1500 сторінок рукописного тексту[2]. У США книжка вийшла у твердій обкладинці на 1040 сторінок.', 'a-dance-with-dragons.jpeg', '8', '2023-02-27 14:38:09', 888, 19, 2011, '2', '3', 34, 'yes'),
(31, 'По кому подзвін', 'Ернест Хемінгуей', '«По ко́му по́дзвін» (англ. For Whom the Bell Tolls) — роман американського письменника Ернеста Гемінґуея, опублікований 1940 року. У романі розповідається історія Роберта Джордана, американського добровольця в лавах республіканців під час Громадянської війни в Еспанії. Роман розцінюють як один з найкращих у доробку автора[1], він був кандидатом на Пулітцерівську премію 1941 року.\r\n\r\nГемінґуей написав «По кому подзвін» упродовж 1939 року, працюючи на Кубі, в Кі-Весті та Сан-Веллі, Айдахо[2]. Працюючи над рукописом на Кубі, письменник мешкав у готелі Амбос-Мундос[3][4]. Роботу над книгою було завершено в липні 1940 року, а в жовтні її було опубліковано видавництвом Сини Чарльза Скрібнера тиражем 75 тис. примірників. Основою для роману став особистий досвід Хемінгуея, набутий, коли він працював в Іспанії журналістом. Роман одразу ж здобув популярність, став книгою місяця й була номінована на Пулітцерівську премію.\r\n\r\nНазву роману Гемінґуей запозичив у Джона Донна, цитата з якого наведена в епіграфі, зокрема: «не посилай питати, по кому дзвонять, дзвонять по тобі».', 'for-whom-the-bell-tolls.jpeg', '9', '2023-02-27 14:38:09', 304, 19, 1940, '2', '3', 1, 'yes'),
(32, 'Воно', 'Стівен Кінг', '«Воно́» (англ. It) — роман американського письменника Стівена Кінга, написаний у жанрі жахів, уперше опублікований 1986 року видавництвом Viking Press. У творі зачіпаються важливі для Кінга теми: влада пам\'яті, сила в об\'єднанні, вплив травм дитинства на доросле життя. Відповідно до основної сюжетної лінії, семеро друзів з Америки із вигаданого міста Деррі в штаті Мейн борються з почварою, що вбиває дітей і здатна втілюватись у будь-яку фізичну форму. Оповідь здійснюється паралельно в різних часових інтервалах, один із яких відповідає дитинству головних героїв, а інший — їх дорослому життю.', 'it.jpeg', '17', '2023-02-27 14:49:45', 505, 12, 1986, '1', '3', 22, 'yes'),
(33, 'Зелена миля', 'Стівен Кінг', '«Зелена миля» (англ. The Green Mile) — роман американського письменника Стівена Кінга, написаний 1996 року. У 1996 році отримав нагороду Bram Stoker Awards. У 1999 році на його основі створено однойменний фільм. У в\'язниці «Холодна гора» блок смертників називають Зеленою Милею. Там бачили різних ув\'язнених, але одного разу на Милю привозять Джона Коффі — величезного негра, який нібито вчинив страшний злочин — жорстоко вбив двох маленьких дівчаток. І ось, головному герою, Полу Еджкомбу та іншим співробітникам блоку належить дізнатися, що не все буває таким, яким здається. Трапляється що той, хто за ґратами, може бути кращим за того, хто зовні. А смерть може стати бажаним порятунком від тяжкого тягаря життя.', 'the-green-mile .jpeg', '8', '2023-02-27 14:49:45', 403, 16, 1996, '1', '3', 30, 'yes'),
(34, 'Над зозулиним гніздом', 'Кен Кізі', '«На́д зозу́линим гніздо́м» («Політ над гніздом зозулі», англ. One Flew over the Cuckoo\'s Nest — дослівно: «Одна полетіла над зозулиним гніздом») — роман Кена Кізі. В основу твору ліг авторський досвід роботи у психіатричній лікарні, де проводили «ЛСД-сесії» та робили досліди із використанням сильнодіючих наркотиків.\r\n\r\nНомер 58 у Рейтингу 100 найкращих книг усіх часів журналу Ньюсвік[1].\r\n\r\nРоман написано в 1959 і опубліковано в 1962. У 1963 році Дейл Вассерман інсценізував твір на сцені Бродвею; у 1975 році за романом знято фільм, який здобув п\'ять «Оскарів». Щотижневий американський журнал «Тайм» включив роман Кізі до «100 найкращих англомовних романів з 1923 року за версією „Тайм“».', 'one-flew-over-the-cuckoo\'s-nest .jpeg', '18', '2023-02-27 14:53:28', 233, 0, 1962, '1', '3', 2, 'yes'),
(35, 'Мобі Дік', 'Герман Мелвілл', '«Мо́бі Дік, а́бо Бі́лий кит» (англ. «Moby-Dick, or The Whale») — роман 1851 року, найвідоміший твір американського письменника Германа Мелвілла (1819—1891). Книга частково заснована на реальних подіях, які трапилися в 1820 році з китобійним кораблем «Ессекс» (у романі він називається «Пеквод»). Твір містить багато символізму та підтексту.', 'moby-dick.jpeg', '3', '2023-02-27 14:53:28', 421, 7, 1851, '1', '3', 9, 'no'),
(36, 'Старий і море', 'Ернест Хемінгуей', '«Стари́й і мо́ре» (англ. The Old Man And The Sea) — короткий роман-притча американського письменника Ернеста Хемінгуея, виданий у 1952 році. В основі роману розповідь про кубинського рибалку Сантьяго, його боротьбу з гігантською рибиною, що стала найбільшою здобиччю в його житті. Хемінгуей присвятив книгу своєму видавцеві Чарлзу Скрібнеру та літературному редакторові Максвеллу Перкінсу', 'the-old-man-and-the-sea.jpeg', '16', '2023-02-27 15:32:15', 189, 0, 1952, '1', '3', 10, 'yes'),
(37, 'На Західному фронті без змін', 'Еріх Марія Ремарк', '«На Західному фронті без змін» або «На Заході без змін» (нім. Im Westen nichts Neues, дослівно — «На Заході нічого нового») — антивоєнний роман німецького письменника Еріха Марії Ремарка, виданий 1929 р. У передмові до нього автор говорить: «Ця книга — не викриття і не сповідь. Це лише спроба розповісти про покоління, яке занапастила війна, про тих, хто став її жертвою, навіть якщо врятувався від снарядів».', 'all-quiet-on-the-western-front.jpeg', '9', '2023-02-27 15:32:15', 333, 0, 1929, '4', '5', 100, 'yes'),
(38, 'І не лишилось жодного', 'Агата Крісті', '«І не лиши́лось жо́дного» (англ. And then there were none) — детективний роман англійської письменниці Агати Крісті, написаний 1939 року та виданий у Лондоні під назвою «Десятеро негренят» (англ. Ten little niggers). Однак уже в першому американському виданні наступного 1940 року книга вийшла під назвою «І не лишилось жодного». З того часу це єдина назва в усьому англомовному світі. Також виходив як «Десятеро індіанців» (англ. Ten little Indians). За словами авторки, найкращий її твір. Роман є найвідомішим та найпопулярнішим твором Агати Крісті: у світі продано понад сто мільйонів екземплярів книги.', 'and-then-there-were-none.jpeg', '1', '2023-02-27 15:36:05', 539, 0, 1939, '1', '2', 27, 'yes'),
(39, 'Дон Кіхот', 'Міґель де Сервантес', 'У романі йдеться про дивовижні, часто комічні, а інколи й болісні пригоди славетного лицаря Дон Кіхота з Ламанчі. Занадто захопившись лицарськими романами, він вирішує стати одним із героїв улюблених книг — відважним і хоробрим лицарем, щоби разом зі своїм відданим супутником Санчо Пансою захищати принижених, викорінювати у світі насилля і гноблення, встановити на землі царство справедливості й свободи.', 'don-quixote.jpeg', '9', '2023-02-27 15:36:05', 289, 5, 1605, '5', '6', 19, 'yes'),
(40, 'Фауст', 'Йоганн Вольфганг фон Гете', '«Фауст» (нім. Faust) — філософська трагедія, твір всього життя німецького письменника Йоганна Вольфганга Гете. У його основі лежить — найвідоміший варіант легенди про доктора Фауста.\r\n\r\nНад поемою Гете працював упродовж 60 років; вона є його «твором життя». Першу частину (нім. Faust: der Tragödie erster Teil) написано ще в 1790-ті роки, закінчено 1806 року, опубліковано 1808 року. Кілька разів Гете переробляв і перевидавав її (останнє перевидання 1828 року). Над другою частиною (нім. Faust: der Tragödie zweiter Teil) автор працював уже наприкінці життя (вона побачила світ вже після його смерті 1832 року). 1886 року був знайдений текст «Прафауста» (Urfaust), створеного Гете в молодості (1772—1775 рр.).\r\n\r\nЗавдяки складній примхливості ритмів і мелодики «Фауст» уважається однією з вершин німецької поезії.\r\n\r\nТрагедія «Фауст» — твір досить складний, тому що порушує одвічні проблеми, які кожне покоління намагається розвязати. Жага пізнання в людині закладена, напевно, генетично: прагнення до добра, що повсякчас бореться зі злом.', '1677882041faust.jpeg', '19', '2023-03-04 00:20:41', 587, 23, 1774, '4', '5', 301, 'yes'),
(41, 'Дракула', 'Брем Стокер', '«Дра́кула» (англ. Dracula) — роман ірландс ького п и сьменника Брема Стокера, вперше опублікований у 1897 році. Твір має дос', '1677882437dracula.jpeg', '17', '2023-03-04 00:27:17', 666, 12, 1897, '2', '2', 305, 'yes');

-- --------------------------------------------------------

--
-- Структура таблицы `book_id`
--

CREATE TABLE `book_id` (
  `id` int NOT NULL,
  `name` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `book_id`
--

INSERT INTO `book_id` (`id`, `name`) VALUES
(1, 'детектив'),
(2, 'жахи'),
(3, 'фантастика'),
(4, 'любовний роман'),
(5, 'пригодницький '),
(6, 'поезія'),
(7, 'комікси і манга'),
(8, 'фентезі'),
(9, 'роман'),
(10, 'модерністська література'),
(11, 'казка'),
(12, 'автобіографія'),
(13, 'есей'),
(14, 'художнє дослідження '),
(15, 'антиутопія'),
(16, 'повість'),
(17, 'хорор'),
(18, 'постмодерністська література'),
(19, 'філософська трагедія');

-- --------------------------------------------------------

--
-- Структура таблицы `countries`
--

CREATE TABLE `countries` (
  `id` int NOT NULL,
  `country` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `countries`
--

INSERT INTO `countries` (`id`, `country`) VALUES
(1, 'Україна'),
(2, 'Велика Британія'),
(3, 'США'),
(4, 'Франція'),
(5, 'Німеччина'),
(6, 'Іспанія'),
(7, 'Італія'),
(8, 'Польща'),
(9, 'Швеція'),
(10, 'Фінляндія'),
(11, 'Австрія'),
(12, 'Чехія'),
(13, 'Росія'),
(14, 'Нідерланди'),
(15, 'Бразилія');

-- --------------------------------------------------------

--
-- Структура таблицы `languages`
--

CREATE TABLE `languages` (
  `id` int NOT NULL,
  `name` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `languages`
--

INSERT INTO `languages` (`id`, `name`) VALUES
(1, 'українська'),
(2, 'англійська'),
(3, 'французська'),
(4, 'німецька'),
(5, 'іспанська'),
(6, 'італійська'),
(7, 'польська'),
(8, 'шведська'),
(9, 'фінська'),
(10, 'російська'),
(11, 'португальська'),
(12, 'нідерландська');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int NOT NULL,
  `lastname` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `firstname` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `patronymic` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `email` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `phone` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `region` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `settlement` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `street` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `home` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `bid` text COLLATE utf8mb4_general_ci NOT NULL,
  `posttype` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `price` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `lastname`, `firstname`, `patronymic`, `email`, `phone`, `region`, `settlement`, `street`, `home`, `bid`, `posttype`, `price`) VALUES
(1, 'Ivan', 'Ivanov', 'Ivanovich', 'ivan@ukr.net', '123456', 'Київська', 'Київ', 'Перемоги', '34', '22x2,23x2,24x1,26x1,', 'ukr_poshta', 2796),
(2, 'Ivan', 'Ivanov', 'Ivanovich', 'ivan@ukr.net', '123456', 'Київська', 'Київ', 'Перемоги2', '34', '22x2,23x2,24x1,26x1,', 'ukr_poshta', 2796),
(3, 'Олександр', 'Кириченко', 'Васильович', 'a.kirichenko2312@gmail.com', '+380675811827', 'Київська', 'Київ', 'Панаса Мирного', '18', '22x1,23x1,26x1,', 'nova_poshta', 1533),
(4, 'test', 'test', 'test', 'test@test', '123', 'Київська', 'Фастів', 'Новозеландська', '19', '22x1,23x1,26x1,', 'nova_poshta', 1702),
(5, 'test2', 'test2', 'test2', 'test2@test2', '123', '1', '2', '3', '4', '22x1,26x1,37x1,', 'ukr_poshta', 1548),
(6, '1', '2', '3', '12212@a', '123', '1', '3', '4', '8', '22x1,23x1,26x1,', 'nova_poshta', 1533),
(7, '3', '3', '3', '3@3', '3', '1', '2', '3', '4', '18x2,22x1,', 'nova_poshta', 1291),
(8, '2', '2', '2', '2@22', '2', '1', '2', '3', '4', '24x1,26x1,41x1,', 'ukr_poshta', 1792);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `username` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL,
  `password` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL,
  `email` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL,
  `role` varchar(1000) COLLATE utf8mb4_general_ci NOT NULL,
  `favourite` text COLLATE utf8mb4_general_ci,
  `basket` text COLLATE utf8mb4_general_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `email`, `role`, `favourite`, `basket`) VALUES
(8, 'MyLifeForUkraine', 'd8578edf8458ce06fbc5bb76a58c5ca4', 'a.kirichenko2312@gmail.com', 'admin', '24,41,', ''),
(20, 'ivan', '2c42e5cf1cdbafea04ed267018ef1511', 'ivan@gmail.com', 'user', '24,', '24x1,26x1,'),
(21, 'vitia', '202cb962ac59075b964b07152d234b70', 'vitia@gmail.com', 'user', NULL, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `book_id`
--
ALTER TABLE `book_id`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `languages`
--
ALTER TABLE `languages`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `books`
--
ALTER TABLE `books`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT для таблицы `book_id`
--
ALTER TABLE `book_id`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `countries`
--
ALTER TABLE `countries`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT для таблицы `languages`
--
ALTER TABLE `languages`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
